## 1. Import Library
Pada Tahap ini kita akan import library yang dibutuhkan

In [35]:
import pandas as pd
import numpy as np
from sklearn.preprocessing import LabelEncoder, StandardScaler
from sklearn.preprocessing import MinMaxScaler

## 2. Dowload dan Load Dataset
Mendowload Dataset dari Kaggle,
Lalu memasukkan dataset yang ingin diolah

Di sini kita akan load file CSV, melihat 10 baris pertama, melihat informasi kolom, dan menghitung missing value.

- `pd.read_csv()` — membaca file CSV dan mengembalikan `DataFrame`.
- `df.head()` — menampilkan n baris pertama.
- `df.info()` — menampilkan tipe data dan jumlah non-null per kolom.
- `df.isnull().sum()` — menghitung jumlah missing value per kolom.

In [36]:
df = pd.read_csv("dataset_contoh.csv")
print(df)

      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    karachi    Finance  125917.01    ahmed48gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com
19   tariq    Male   NaN     Lahore        HR         NaN   tariq76@gmail.com

In [37]:
print('=== Preview (first 10 rows) ===')
display(df.head(10))

print('\n=== Info ===')
df.info()

print('\n=== Missing values per column ===')
print(df.isnull().sum())

print('\n=== Numeric summary ===')
display(df.describe(include='number').T)

=== Preview (first 10 rows) ===

     Name  Gender   Age       City Department     Salary               Email
0   Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1    Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2   Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3    Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4  Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5   Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6   Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7   Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8   Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9    Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com

=== Info ===
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        20 non-null     object
 1   Gender      20 non-null     object
 2   Age         7 non-null      float64
 3   City        20 non-null     object
 4   Department  20 non-null     object
 5   Salary      14 non-null     float64
 6   Email       20 non-null     object
dtypes: float64(2), object(5)
memory usage: 1.2+ KB

=== Missing values per column ===
Name           0
Gender         0
Age           13
City           0
Department     0
Salary         6
Email          0
dtype: int64

=== Numeric summary ===

,count,mean,std,min,25%,50%,75%,max
Age,7.0,39.857143,13.557637,21.00,31.000,40.000,48.00,60.00
Salary,14.0,105991.486429,43246.375835,32984.18,68489.205,125800.475,131163.24,149944.07

<!-- 3. EDA -->

## 3. Data Cleaning
Tahapan ini bertujuan untuk memperbaiki kualitas data dengan melakukan beberapa proses:
1. Hapus data duplikat
2. Cek dan tangani missing value
3. Perbaikan format penulisan huruf pada kolom teks
4. Validasi format Email
5. Menangani outlier pada kolom Salary

## a.) Menghapus Duplikat

In [38]:
print("\n=== Jumlah Data Sebelum Menghapus Duplikat ===")
print(len(df))
# df = pd.read_csv("dataset_contoh.csv")
# print(df)   

# Hapus duplikat berdasarkan Email (asumsi Email adalah unique identifier)
df = df.drop_duplicates(subset=["Email"], keep="first")

print("\n=== Jumlah Data Sesudah Menghapus Duplikat ===")
print(len(df))
print(df)

=== Jumlah Data Sebelum Menghapus Duplikat ===
20

=== Jumlah Data Sesudah Menghapus Duplikat ===
19
      Name  Gender   Age       City Department     Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    karachi    Finance  125917.01    ahmed48gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com

## b.) Menangani Missing Values
Strategi sederhana:
1. Numerik -> isi dengan median
2. Kategorikal -> isi dengan mode
3. Drop kolom dengan >50% missing

In [39]:
print("\n=== Missing Value Sebelum Dibersihkan ===")
print(df.isnull().sum())

# Mengisi missing numerik dengan median
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Salary"] = df["Salary"].fillna(df["Salary"].median())

# Mengisi missing kategorikal dengan mode
df["Name"] = df["Name"].fillna(df["Name"].mode()[0])
df["Gender"] = df["Gender"].fillna(df["Gender"].mode()[0])
df["City"] = df["City"].fillna(df["City"].mode()[0])
df["Department"] = df["Department"].fillna(df["Department"].mode()[0])

print("\n=== Missing Value Sesudah Dibersihkan ===")
print(df.isnull().sum())
print(df)

=== Missing Value Sebelum Dibersihkan ===
Name           0
Gender         0
Age           12
City           0
Department     0
Salary         5
Email          0
dtype: int64

=== Missing Value Sesudah Dibersihkan ===
Name          0
Gender        0
Age           0
City          0
Department    0
Salary        0
Email         0
dtype: int64
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.940    hina90@gmail.com
2    Usman    Male  36.0     lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     lahore         HR  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         IT  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
10   Ahmed  Female  40.0    karachi    Finance  125917.010    ahmed48gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         HR  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         IT  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         IT  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         HR  125800.475    sara96@gmail.com

## c.) Perbaikan Format Teks (konsistansi kapital)

In [40]:
df["Name"] = df["Name"].str.title()
df["City"] = df["City"].str.title()
df["Department"] = df["Department"].str.title()

print("\n=== Data Setelah Format Huruf Dibenahi ===")
print(df)

=== Data Setelah Format Huruf Dibenahi ===
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
10   Ahmed  Female  40.0    Karachi    Finance  125917.010    ahmed48gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         It  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

## d.) Validasi Email

In [41]:
print("\n=== Jumlah Data Sebelum Validasi Email ===")
print(len(df))

df = df[df["Email"].str.contains("@", na=False)]

print("\n=== Jumlah Data Sesudah Validasi Email ===")
print(len(df))
print(df)

=== Jumlah Data Sebelum Validasi Email ===
19

=== Jumlah Data Sesudah Validasi Email ===
18
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.410    sana72@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
5    Ahmed    Male  40.0     Quetta    Finance   50115.700   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.180   bilal93@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
11   Ahmed    Male  40.0     Quetta    Finance   43153.970   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
14   Usman  Female  40.0  Islamabad  Marketing   39515.870    usman3@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
17   Bilal    Male  40.0     Quetta         It  149944.070   bilal71@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

## e.) Menghapus Outlier Salary

In [42]:
print("\n=== Range Salary Sebelum Outlier Dihapus ===")
print(df["Salary"].describe())

Q1 = df["Salary"].quantile(0.25)
Q3 = df["Salary"].quantile(0.75)
print("Q1 (Quartile 1) =", Q1)
print("Q3 (Quartile 3) =", Q3)

IQR = Q3 - Q1
low = Q1 - (1.5 * IQR)
high = Q3 + (1.5 * IQR)


df = df[(df["Salary"] >= low) & (df["Salary"] <= high)]

print("\n=== Range Salary Sesudah Outlier Dihapus ===")
print(df["Salary"].describe())
print(df)
print("\nBatas bawah (low) =", low)
print("Batas atas (high) =", high)

=== Range Salary Sebelum Outlier Dihapus ===
count        18.000000
mean     110387.009722
std       38752.927554
min       32984.180000
25%      123677.490000
50%      125800.475000
75%      127962.980000
max      149944.070000
Name: Salary, dtype: float64
Q1 (Quartile 1) = 123677.49
Q3 (Quartile 3) = 127962.98000000001

=== Range Salary Sesudah Outlier Dihapus ===
count        12.000000
mean     126945.914583
std        3032.124813
min      123609.720000
25%      125771.341250
50%      125800.475000
75%      127503.240000
max      133554.550000
Name: Salary, dtype: float64
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

Batas bawah (low) = 117249.255
Batas atas (high) = 134391.21500000003

## f.) Data Bersih

In [43]:
print("\n=== DATA BERSIH FINAL ===")
print(df)

=== DATA BERSIH FINAL ===
      Name  Gender   Age       City Department      Salary               Email
0    Tariq    Male  47.0    Karachi     Sales   123609.720   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         Hr  125683.940    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales   125800.475   usman71@gmail.com
4   Ayesha    Male  40.0     Lahore         Hr  123880.800  ayesha25@gmail.com
7    Ahmed  Female  40.0     Quetta         It  125800.475   ahmed89@gmail.com
8    Usman    Male  40.0     Quetta      Sales  125800.475   usman35@gmail.com
9     Sara  Female  40.0  Islamabad    Finance  127273.370    sara73@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.850    sana54@gmail.com
13     Ali  Female  40.0   Peshawar         Hr  133554.550     ali88@gmail.com
15   Ahmed  Female  40.0     Quetta      Sales  125800.475   ahmed40@gmail.com
16   Usman  Female  40.0     Lahore         It  132153.370   usman15@gmail.com
18    Sara  Female  40.0    Karachi         Hr  125800.475    sara96@gmail.com

## 4. Data Reduction
Ini adalah proses mengurangi jumlah fitur dengan cara mengubah fitur lama menjadi fitur baru, tapi tetap mempertahankan informasi penting.

Data Reduction terdiri dari 3 teknik utama:

- Feature Selection
- Dimensionality Reduction
- Numerosity Reduction

## - Feature Selection

In [44]:
df_reduced = df.drop(columns=["Email"])
print("\n=== DATA FINAL TANPA KOLOM EMAIL ===")
print(df_reduced)

=== DATA FINAL TANPA KOLOM EMAIL ===
      Name  Gender   Age       City Department      Salary
0    Tariq    Male  47.0    Karachi     Sales   123609.720
1     Hina  Female  26.0     Quetta         Hr  125683.940
2    Usman    Male  36.0     Lahore     Sales   125800.475
4   Ayesha    Male  40.0     Lahore         Hr  123880.800
7    Ahmed  Female  40.0     Quetta         It  125800.475
8    Usman    Male  40.0     Quetta      Sales  125800.475
9     Sara  Female  40.0  Islamabad    Finance  127273.370
12    Sana    Male  49.0    Karachi      Sales  128192.850
13     Ali  Female  40.0   Peshawar         Hr  133554.550
15   Ahmed  Female  40.0     Quetta      Sales  125800.475
16   Usman  Female  40.0     Lahore         It  132153.370
18    Sara  Female  40.0    Karachi         Hr  125800.475

## - Numerosity

In [45]:
# Agregasi gaji rata-rata per departemen
print("\n=== NUMEROSITY: AGGREGATION (MEAN PER DEPARTMENT) ===")

df_agg = df_reduced.groupby("Department")["Salary"].mean()

print(df_agg)

=== NUMEROSITY: AGGREGATION (MEAN PER DEPARTMENT) ===
Department
 Sales     124705.097500
Finance    127273.370000
Hr         127229.941250
It         128976.922500
Sales      126597.933333
Name: Salary, dtype: float64

In [46]:
print("\n=== DATA BERSIH SETELAH DATA RERDUCTION ===")
print(df_reduced)
print(df_agg)

=== DATA BERSIH SETELAH DATA RERDUCTION ===
      Name  Gender   Age       City Department      Salary
0    Tariq    Male  47.0    Karachi     Sales   123609.720
1     Hina  Female  26.0     Quetta         Hr  125683.940
2    Usman    Male  36.0     Lahore     Sales   125800.475
4   Ayesha    Male  40.0     Lahore         Hr  123880.800
7    Ahmed  Female  40.0     Quetta         It  125800.475
8    Usman    Male  40.0     Quetta      Sales  125800.475
9     Sara  Female  40.0  Islamabad    Finance  127273.370
12    Sana    Male  49.0    Karachi      Sales  128192.850
13     Ali  Female  40.0   Peshawar         Hr  133554.550
15   Ahmed  Female  40.0     Quetta      Sales  125800.475
16   Usman  Female  40.0     Lahore         It  132153.370
18    Sara  Female  40.0    Karachi         Hr  125800.475
Department
 Sales     124705.097500
Finance    127273.370000
Hr         127229.941250
It         128976.922500
Sales      126597.933333
Name: Salary, dtype: float64

## 5. Data Transformation

## - NORMALIZATION (Min–Max Scaling)

Mengubah nilai menjadi skala 0 – 1.

Dipakai ketika:

- Mau menyamakan skala antara Age & Salary
- Salary jauh lebih besar angkanya daripada Age → butuh distandarkan

In [47]:
scaler = MinMaxScaler()

df_trans = df_reduced.copy()  # hasil dari data reduction

df_trans[["Age_norm", "Salary_norm"]] = scaler.fit_transform(df_trans[["Age", "Salary"]])

print("\n=== NORMALIZATION (Min-Max) ===")
print(df_trans[["Age", "Age_norm", "Salary", "Salary_norm"]])

=== NORMALIZATION (Min-Max) ===
     Age  Age_norm      Salary  Salary_norm
0   47.0  0.913043  123609.720     0.000000
1   26.0  0.000000  125683.940     0.208573
2   36.0  0.434783  125800.475     0.220291
4   40.0  0.608696  123880.800     0.027258
7   40.0  0.608696  125800.475     0.220291
8   40.0  0.608696  125800.475     0.220291
9   40.0  0.608696  127273.370     0.368397
12  49.0  1.000000  128192.850     0.460856
13  40.0  0.608696  133554.550     1.000000
15  40.0  0.608696  125800.475     0.220291
16  40.0  0.608696  132153.370     0.859105
18  40.0  0.608696  125800.475     0.220291

## Standarization

In [48]:
std = StandardScaler()

df_trans["Salary_zscore"] = std.fit_transform(df_trans[["Salary"]])

print("\n=== STANDARDIZATION (Z-SCORE) ===")
print(df_trans[["Salary", "Salary_zscore"]])

=== STANDARDIZATION (Z-SCORE) ===
        Salary  Salary_zscore
0   123609.720      -1.149208
1   125683.940      -0.434708
2   125800.475      -0.394566
4   123880.800      -1.055830
7   125800.475      -0.394566
8   125800.475      -0.394566
9   127273.370       0.112797
12  128192.850       0.429528
13  133554.550       2.276455
15  125800.475      -0.394566
16  132153.370       1.793795
18  125800.475      -0.394566

## Encoding Kategori

In [49]:
le = LabelEncoder()

df_trans["Gender_enc"] = le.fit_transform(df_trans["Gender"])

print("\n=== LABEL ENCODING (GENDER) ===")
print(df_trans[["Gender", "Gender_enc"]])

=== LABEL ENCODING (GENDER) ===
    Gender  Gender_enc
0     Male           1
1   Female           0
2     Male           1
4     Male           1
7   Female           0
8     Male           1
9   Female           0
12    Male           1
13  Female           0
15  Female           0
16  Female           0
18  Female           0

## One-Hot Encoding

In [50]:
df_trans = pd.get_dummies(
    df_trans,
    columns=["City", "Department"],
    prefix=["City", "Dept"],
    dtype=int
)

print("\n=== ONE-HOT ENCODING (CITY & DEPARTMENT) & FINAL DATA TRANSFORMATION ===")
print(df_trans)

=== ONE-HOT ENCODING (CITY & DEPARTMENT) & FINAL DATA TRANSFORMATION ===
      Name  Gender   Age      Salary  Age_norm  Salary_norm  Salary_zscore  \
0    Tariq    Male  47.0  123609.720  0.913043     0.000000      -1.149208
1     Hina  Female  26.0  125683.940  0.000000     0.208573      -0.434708
2    Usman    Male  36.0  125800.475  0.434783     0.220291      -0.394566
4   Ayesha    Male  40.0  123880.800  0.608696     0.027258      -1.055830
7    Ahmed  Female  40.0  125800.475  0.608696     0.220291      -0.394566
8    Usman    Male  40.0  125800.475  0.608696     0.220291      -0.394566
9     Sara  Female  40.0  127273.370  0.608696     0.368397       0.112797
12    Sana    Male  49.0  128192.850  1.000000     0.460856       0.429528
13     Ali  Female  40.0  133554.550  0.608696     1.000000       2.276455
15   Ahmed  Female  40.0  125800.475  0.608696     0.220291      -0.394566
16   Usman  Female  40.0  132153.370  0.608696     0.859105       1.793795
18    Sara  Female  40.0  125800.475  0.608696     0.220291      -0.394566

    Gender_enc  City_Islamabad  City_Karachi  City_Lahore  City_Peshawar  \
0            1               0             1            0              0
1            0               0             0            0              0
2            1               0             0            1              0
4            1               0             0            1              0
7            0               0             0            0              0
8            1               0             0            0              0
9            0               1             0            0              0
12           1               0             1            0              0
13           0               0             0            0              1
15           0               0             0            0              0
16           0               0             0            1              0
18           0               0             1            0              0

    City_Quetta  Dept_ Sales   Dept_Finance  Dept_Hr  Dept_It  Dept_Sales
0             0             1             0        0        0           0
1             1             0             0        1        0           0
2             0             1             0        0        0           0
4             0             0             0        1        0           0
7             1             0             0        0        1           0
8             1             0             0        0        0           1
9             0             0             1        0        0           0
12            0             0             0        0        0           1
13            0             0             0        1        0           0
15            1             0             0        0        0           1
16            0             0             0        0        1           0
18            0             0             0        1        0           0

## Data Integration

In [51]:
df = pd.read_csv("dataset_contoh.csv")

df["City"] = df["City"].str.capitalize()


# Tambah kolom Province berdasarkan City
province_map = {
    "Karachi": "Sindh",
    "Lahore": "Punjab",
    "Quetta": "Balochistan",
    "Peshawar": "Khyber Pakhtunkhwa",
    "Islamabad": "Islamabad Capital Territory"
}

# Mapping ke kolom baru
df["Province"] = df["City"].map(province_map)


print(df.head(20))

      Name  Gender   Age       City Department     Salary               Email  \
0    Tariq    Male  47.0    Karachi     Sales   123609.72   tariq76@gmail.com
1     Hina  Female  26.0     Quetta         HR  125683.94    hina90@gmail.com
2    Usman    Male  36.0     Lahore     Sales         NaN   usman71@gmail.com
3     Sana  Female  21.0     Quetta    Finance  147901.41    sana72@gmail.com
4   Ayesha    Male  40.0     Lahore         HR  123880.80  ayesha25@gmail.com
5    Ahmed    Male   NaN     Quetta    Finance   50115.70   ahmed33@gmail.com
6    Bilal  Female  60.0   Peshawar    Finance   32984.18   bilal93@gmail.com
7    Ahmed  Female   NaN     Quetta         IT        NaN   ahmed89@gmail.com
8    Usman    Male   NaN     Quetta      Sales        NaN   usman35@gmail.com
9     Sara  Female   NaN  Islamabad    Finance  127273.37    sara73@gmail.com
10   Ahmed  Female   NaN    Karachi    Finance  125917.01    ahmed48gmail.com
11   Ahmed    Male   NaN     Quetta    Finance   43153.97   ahmed44@gmail.com
12    Sana    Male  49.0    Karachi      Sales  128192.85    sana54@gmail.com
13     Ali  Female   NaN   Peshawar         HR  133554.55     ali88@gmail.com
14   Usman  Female   NaN  Islamabad  Marketing   39515.87    usman3@gmail.com
15   Ahmed  Female   NaN     Quetta      Sales        NaN   ahmed40@gmail.com
16   Usman  Female   NaN     Lahore         IT  132153.37   usman15@gmail.com
17   Bilal    Male   NaN     Quetta         IT  149944.07   bilal71@gmail.com
18    Sara  Female   NaN    Karachi         HR        NaN    sara96@gmail.com
19   tariq    Male   NaN     Lahore        HR         NaN   tariq76@gmail.com

                       Province
0                         Sindh
1                   Balochistan
2                        Punjab
3                   Balochistan
4                        Punjab
5                   Balochistan
6            Khyber Pakhtunkhwa
7                   Balochistan
8                   Balochistan
9   Islamabad Capital Territory
10                        Sindh
11                  Balochistan
12                        Sindh
13           Khyber Pakhtunkhwa
14  Islamabad Capital Territory
15                  Balochistan
16                       Punjab
17                  Balochistan
18                        Sindh
19                       Punjab